app/controllers/articles_controller.rb

	def index
		@articles = Article.all #according to REST, a request to /articles/ should list out all.
		#must be declared as an instance variable in order to be available to the view.
	end
---
SELECT "articles".* FROM "articles"

	def show
		#the view links to articles/id, which goes to a SHOW method.
		@article = Article.find(params[:id])
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

	def create
		@article = Article.new(article_params) #references helper method
		@article.save
---
INSERT INTO "articles" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Welcome!"], ["body", "Do whatever you want with this site."], ["created_at", "2018-10-12 10:46:04.436462"], ["updated_at", "2018-10-12 10:46:04.436462"]]